var continentsWithCountries = [{
    Text: "北アメリカ",
    Description: "北アメリカは、アメリカ (米州) の北半の、北アメリカ大陸を中心とした地域である。六大州の1つ。アジアとの境界はベーリング海峡である。ヨーロッパとの境界は、グリーンランドとアイスランドの間のデンマーク海峡である。",
    Countries: [{
        Text: "米国",
        Description: "アメリカ合衆国は、北アメリカ大陸および北太平洋に位置する連邦共和国である。国土は、北アメリカ大陸中央部の大西洋と太平洋に挟まれた本土（48州と連邦政府直轄地である首都ワシントンD.C.）、大陸北西部のアラスカとアリューシャン列島（アラスカ州）、太平洋のハワイ諸島（ハワイ州）。"
    }, {
        Text: "カナダ",
        Description: "カナダは、北アメリカ大陸北部に位置し、10 の州と 3 の準州を持つ、連邦立憲君主制国家。首都はオタワ。アメリカ合衆国と国境を接する。イギリス連邦加盟国であり、英連邦王国の一国である。世界で2番目に大きい面積の国土をもつ。"
    }, {
        Text: "メキシコ",
        Description: "メキシコ合衆国、通称メキシコは、北アメリカ南部に位置する連邦共和制国家である。北にアメリカ合衆国と、南東にグアテマラ、ベリーズと国境を接し、西は太平洋、東はメキシコ湾とカリブ海に面する。首都はメキシコシティ。公用語はスペイン語。総人口は約1億人。スペイン語圏においては最も人口の多い国である。"
    }]
}, {
    Text: "南アメリカ",
    Description: "南アメリカは、南米ともいい、南アメリカ大陸とその周辺の島嶼・海域を含む地域の総称で、六大州の一つ。ラテンアメリカに含まれる。",
    Countries: [{
        Text: "ブラジル",
        Description: "ブラジル連邦共和国、通称ブラジルは、南アメリカに位置する連邦共和制国家である。南米大陸で最大の面積を誇り、ウルグアイ、アルゼンチン、パラグアイ、ボリビア、ペルー、コロンビア、ベネズエラ、ガイアナ、スリナム、フランス領ギアナ (つまりチリとエクアドル以外のすべての南米諸国) と国境を接している。また、大西洋上のフェルナンド・デ・ノローニャ諸島、トリンダージ島・マルティン・ヴァス島、セントピーター・セントポール群島もブラジル領に属する。"
    }, {
        Text: "ウルグアイ",
        Description: "ウルグアイ東方共和国、通称ウルグアイは、南アメリカ南東部に位置する共和制国家である。北と東にブラジルと、西にアルゼンチンと国境を接しており、南は大西洋に面している。"
    }, ]
}, {
    Text: "ヨーロッパ",
    Description: "ヨーロッパは、慣習的には地球上の 7 つの大州の一つ。地理的には、ユーラシア大陸北西の半島部を包括し、ウラル山脈およびコーカサス山脈の分水嶺とウラル川・カスピ海・黒海、そして黒海とエーゲ海を繋ぐボスポラス海峡が、アジアと区分される東の境界となる。面積から見るとヨーロッパ大陸は世界で 2 番目に小さな大州であり、1018 万km2 は地球表面積の 2 %、陸地に限れば 6.8 %を占める。アジアに跨る領土を持つロシアは、ヨーロッパ 50 カ国の中で面積および人口第一位の国家である。対照的に最も小さな国家はバチカン市国である。総人口はアジア・アフリカに次ぐ 7 億 3300 万。これは地球総人口の 11 ％である。",
    Countries: [{
        Text: "イギリス",
        Description: "グレートブリテン及び北アイルランド連合王国通称イギリスは、イングランド、スコットランド、ウェールズ、北アイルランドの4つの国 (イギリスのカントリー) から構成される立憲君主制国家であり、英連邦王国の一国である。また、国際関係について責任を負う地域として王室属領及び海外領土があるが、これらは厳密には「グレートブリテン及び北アイルランド連合王国」には含まれておらずこれらを含む正式な名称は存在しない。ユーラシア大陸西部の北西にある島国であるが、アイルランド島でアイルランド共和国と国境を接している。"
    }, {
        Text: "ドイツ",
        Description: "ドイツ連邦共和国、通称ドイツは、ヨーロッパ中部に位置する連邦共和制国家である。領域は1990年のドイツ再統一によって、ドイツ民主共和国 (旧東ドイツ) を構成していた15県および東ベルリンが6州としてドイツ連邦共和国 (西ドイツ) に編入されて、現在の16州となった。"
    }, {
        Text: "ブルガリア",
        Description: "ブルガリア共和国、通称ブルガリアは、東ヨーロッパの共和制国家である。 バルカン半島に位置し、北にルーマニア、西にセルビア、マケドニア共和国、南にギリシャ、トルコと隣接し、東は黒海に面している。首都はソフィア。"
    }]
}, {
	Text: "アジア",
	Description: "アジアはユーラシアの東部と中部であり、この地域にはおよそ50カ国が存在する。この地域の面積は大陸のほかに島嶼部も含めるとおよそ49,694,700km2である。アジアはスエズ地峡 (エジプト) でアフリカと接し、ウラル山脈付近を境界にヨーロッパと接する。現在ではユーラシア大陸のヨーロッパ以外の地域、つまり、アジア大陸 (島嶼・海域を含む) であり、六大州の一つ。ユーラシア大陸の面積の約 80 %をアジアが占め、人口は世界最多で世界人口の約 60 % がアジアに住んでいる。",
	Countries: [{
		Text: "日本",
		Description: "日本の領土はすべて島から成っている。6,852 の島 (本土 5 島+離島 6,847 島) から成る島国である。アジア・東アジアの中でも特に東方にあり、ユーラシアの東端にあたるため、欧米から極東・東洋などとも呼ばれる。全体的に弓形状であり、領土面積は約37.8万km²(日本政府が領有権を主張する領域) で世界第 60 位である。国土の約70%が山岳地帯であり、約 67 %の森林率である。"
	}, {
		Text: "中国",
		Description: "正式名称は中華人民共和国。世界最大の人口を持つ国で、アジア大陸の東部、太平洋の西海岸に位置し、国土はチベットとウイグル (東トルキスタン) も中国と見なした場合はロシアとカナダに次ぐ面積であり、世界第 3 の大きさであるとされることが多い。単一政権の共産党で、政府の所在地は首都である北京である。また、中華民国によって統治されている台湾の領有を主張している。今日では省轄市と縣が直轄市と並んで地方行政を担っているが、直轄市との間には地方交付税の配分や人事権限の格差が残されたままである。"
	}]
} ];

var continentsWithCountriesAndCitiesCoordinates = [{
    Text: "北アメリカ",
    Latitude: 46.0730555556,
    Longitude: -100.546666667,
    Countries: [{
        Text: "米国",
        Latitude: 38,
        Longitude: -97,
        Cities: [{
            Name: "ロサンゼルス",
            Country: "米国",
            Latitude: 34.0522,
            Longitude: -118.2434
        }, {
            Name: "ニューヨーク",
            Country: "米国",
            Latitude: 40.7561,
            Longitude: -73.9870
        }, {
            Name: "シカゴ",
            Country: "米国",
            Latitude: 41.840,
            Longitude: -87.680
        }, {
            Name: "ヒューストン",
            Country: "米国",
            Latitude: 29.770,
            Longitude: -95.390
        }]
    }, {
        Text: "カナダ",
        Latitude: 60,
        Longitude: -95,
        Cities: [{
            Name: "トロント",
            Country: "カナダ",
            Latitude: 43.650,
            Longitude: -79.380
        }, {
            Name: "モントリオール",
            Country: "カナダ",
            Latitude: 45.520,
            Longitude: -73.570
        }, {
            Name: "バンクーバー",
            Country: "カナダ",
            Latitude: 49.280,
            Longitude: -123.130
        }, {
            Name: "カルガリー",
            Country: "カナダ",
            Latitude: 51.050,
            Longitude: -114.060
        }]
    }, {
        Text: "メキシコ",
        Latitude: 23,
        Longitude: -102,
        Cities: [{
            Name: "メキシコ シティ",
            Country: "メキシコ",
            Latitude: 19.4270,
            Longitude: -99.1276
        }, {
            Name: "エカテペック デ モレロス",
            Country: "メキシコ",
            Latitude: 19.600,
            Longitude: -99.050
        }, {
            Name: "グアダラハラ",
            Country: "メキシコ",
            Latitude: 20.670,
            Longitude: -103.350
        }, {
            Name: "プエブラ",
            Country: "メキシコ",
            Latitude: 19.050,
            Longitude: -98.220
        }]
    }]
}, {
    Text: "南アメリカ",
    Latitude: -14.6047222222,
    Longitude: -57.6561111111,
    Countries: [{
        Text: "ブラジル",
        Latitude: -10,
        Longitude: -55,
        Cities: [{
            Name: "サンパウロ",
            Country: "ブラジル",
            Latitude: -23.5489,
            Longitude: -46.6388
        }, {
            Name: "リオデジャネイロ",
            Country: "ブラジル",
            Latitude: -22.910,
            Longitude: -43.200
        }, {
            Name: "サルバドル",
            Country: "ブラジル",
            Latitude: -12.970,
            Longitude: -38.500
        }]
    }, {
        Text: "ウルグアイ",
        Latitude: -33,
        Longitude: -56,
        Cities: [{
            Name: "モンテビデオ",
            Country: "ウルグアイ",
            Latitude: -34.870,
            Longitude: -56.170
        }, {
            Name: "サルト",
            Country: "ウルグアイ",
            Latitude: -31.400,
            Longitude: -57.960
        }, {
            Name: "シウダッド デ ラ コスタ",
            Country: "ウルグアイ",
            Latitude: -34.820,
            Longitude: -55.950
        }]
    }]
}, {
    Text: "ヨーロッパ",
    Latitude: 48.6908333333,
    Longitude: 9.14055555556,
    Countries: [{
        Text: "イギリス",
        Latitude: 54,
        Longitude: -2,
        Cities: [{
            Name: "ロンドン",
            Country: "イギリス",
            Latitude: 51.50,
            Longitude: 0.12
        }, {
            Name: "グラスゴー",
            Country: "イギリス",
            Latitude: 55.870,
            Longitude: -4.270
        }, {
            Name: "バーミンガム",
            Country: "イギリス",
            Latitude: 52.480,
            Longitude: -1.910
        }]
    }, {
        Text: "ドイツ",
        Latitude: 51,
        Longitude: 9,
        Cities: [{
            Name: "ベルリン",
            Country: "ドイツ",
            Latitude: 52.50,
            Longitude: 13.33
        }, {
            Name: "ハンブルグ",
            Country: "ドイツ",
            Latitude: 53.550,
            Longitude: 10.000
        }, {
            Name: "ミュンヘン",
            Country: "ドイツ",
            Latitude: 48.140,
            Longitude: 11.580
        }]
    }, {
        Text: "ブルガリア",
        Latitude: 43,
        Longitude: 25,
        Cities: [{
            Name: "ソフィア",
            Country: "ブルガリア",
            Latitude: 42.697845,
            Longitude: 23.321925
        }, {
            Name: "プロブディブ",
            Country: "ブルガリア",
            Latitude: 42.150,
            Longitude: 24.750
        }, {
            Name: "ブルガス",
            Country: "ブルガリア",
            Latitude: 42.510,
            Longitude: 27.470
        }]
    }]
}, {
	Text: "アジア",
    Latitude: 29.8405555556,
    Longitude: 89.2966666667,
    Countries: [{
        Text: "日本",
        Latitude: 36,
        Longitude: 138,
        Cities: [{
            Name: "東京",
            Country: "日本",
            Latitude: 35.685,
            Longitude: 139.7513889
        }, {
            Name: "横浜",
            Country: "日本",
            Latitude: 35.45,
            Longitude: 139.65
        }, {
            Name: "大阪",
            Country: "日本",
            Latitude: 34.6666667,
            Longitude: 135.5
        }]
    }, {
        Text: "中国",
        Latitude: 35,
        Longitude: 105,
        Cities: [{
            Name: "北京",
            Country: "中国",
            Latitude: 39.92889,
            Longitude: 116.38833
        }, {
            Name: "上海",
            Country: "中国",
            Latitude: 31.005,
            Longitude: 121.4086111
        }]
    }]
}];